# DataFrames

In [10]:
import pandas as pd
import numpy as np


- Create a dataframe with these details
- ** np.random.randn(5,4) ** as first argument
- ** index = ['A','B','C','D','E'] **
- ** columns= ['F','G','H','I','J'] **

In [11]:
np.random.randn(3,3)

array([[-1.00859008, -0.94515347,  1.46605728],
       [ 1.0107793 ,  0.65685865, -0.52002778],
       [ 0.57583091,  0.78846963, -0.48586689]])

In [12]:
df = pd.DataFrame(np.random.randn(3,3), index=['A','B','C'], columns=['F','G','H'])
df

          F         G         H
A  0.665844  0.689546  0.002671
B -1.494107  0.467895  0.455264
C  0.089840  0.214540  1.158228

- Create a dictionary of equal length lists and pass it to a DataFrame
- data = { "movieid" : [1,2,3,4,5,6,7,8], "moviename": ["Toy Story (1995)", "Jumanji (1995)","Grumpier Old Men (1995)","Waiting to Exhale (1995)","Father of the Bride Part II (1995)","Heat (1995)","Sabrina (1995)","Tom and Huck (1995)"]}

In [13]:
data = { "movieid" : [1,2,3,4,5,6,7,8], 
        "moviename": ["Toy Story (1995)", "Jumanji (1995)",
                      "Grumpier Old Men (1995)",
                      "Waiting to Exhale (1995)",
                      "Father of the Bride Part II (1995)",
                      "Heat (1995)","Sabrina (1995)",
                      "Tom and Huck (1995)"]}
df = pd.DataFrame(data)
df

   movieid                           moviename
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)
5        6                         Heat (1995)
6        7                      Sabrina (1995)
7        8                 Tom and Huck (1995)

- Add an extra column using the **columns** parameter
- Can assign values to the newly created row using scalar assignment ** data['rating'] = 0 **
- Cool thing is, we can assign a named index series to a newly created row and will update the matching rows !

In [14]:
df['rating']=0
df

   movieid                           moviename  rating
0        1                    Toy Story (1995)       0
1        2                      Jumanji (1995)       0
2        3             Grumpier Old Men (1995)       0
3        4            Waiting to Exhale (1995)       0
4        5  Father of the Bride Part II (1995)       0
5        6                         Heat (1995)       0
6        7                      Sabrina (1995)       0
7        8                 Tom and Huck (1995)       0

- Name a the columns and the index (rows) just like we did for series **df.index.name ="XYZ" df.columns.name="ABC"**

In [15]:
df.index.name = 'slno'
df.columns.name = 'Movie Data'
df

Movie Data  movieid                           moviename  rating
slno
0                 1                    Toy Story (1995)       0
1                 2                      Jumanji (1995)       0
2                 3             Grumpier Old Men (1995)       0
3                 4            Waiting to Exhale (1995)       0
4                 5  Father of the Bride Part II (1995)       0
5                 6                         Heat (1995)       0
6                 7                      Sabrina (1995)       0
7                 8                 Tom and Huck (1995)       0

## Selection and Indexing

- Various methods to grab data from a DataFrame
- Column values can be used as dictionary keys
- .loc to access by row

- Just get the values df.values
- Check the datatype

In [16]:
df['rating']
row0 = df.loc[0]
row0.index

Index(['movieid', 'moviename', 'rating'], dtype='object', name='Movie Data')

----
- As a dictionary ** df['F'] **
- As dot infix notation ** df.W ** (Not very popular)

In [17]:
df['rating']

slno
0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
Name: rating, dtype: int64

- Also possible to fetch row based data using df.loc['A'] or df.iloc[1]

In [18]:
df = pd.DataFrame(np.random.randn(3,3), index=['A','B','C'], columns=['F','G','H'])
print (df.loc['A'])
print (df.iloc[0])

F    0.293230
G    0.025665
H   -0.826068
Name: A, dtype: float64
F    0.293230
G    0.025665
H   -0.826068
Name: A, dtype: float64

- Can also pass a list of column names ** df[['F','G']] **
- Also check the data types of selecting a single column and selecting multiple columns
- When its a series check the name attribute also !

In [19]:
df[['F','G']]

          F         G
A  0.293230  0.025665
B  0.398519 -0.209922
C  0.848919 -1.277502

- Creating a new column through computation
- ** df['new']= df['W'] + df['Y'] **

In [20]:
df['handg'] = df['H'].mean()
df

          F         G         H     handg
A  0.293230  0.025665 -0.826068  0.356665
B  0.398519 -0.209922  1.631301  0.356665
C  0.848919 -1.277502  0.264761  0.356665

- Dropping rows and columns
- rows can be dropped by index
- columns can be dropped by mentioning column name and axis = 1
- there is an inplace parameter that can be passed **inplace=True** to effect a change in the underlying DF

In [21]:
print (df)
print (df.drop('A'))
print (df)

          F         G         H     handg
A  0.293230  0.025665 -0.826068  0.356665
B  0.398519 -0.209922  1.631301  0.356665
C  0.848919 -1.277502  0.264761  0.356665
          F         G         H     handg
B  0.398519 -0.209922  1.631301  0.356665
C  0.848919 -1.277502  0.264761  0.356665
          F         G         H     handg
A  0.293230  0.025665 -0.826068  0.356665
B  0.398519 -0.209922  1.631301  0.356665
C  0.848919 -1.277502  0.264761  0.356665

- Selecting subset of rows and columns
- df.loc[['A','B'],['W','Y']]
- df.loc['A','W']

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:
- df > 0
- df[df>0]
- df[df['W']>0]
- df[df['W']>0]['Y']
- df[(df['W']>0) & (df['Y'] > 1)]

For two conditions you can use | and & with parenthesis:

## Working with Index

In [22]:
df

          F         G         H     handg
A  0.293230  0.025665 -0.826068  0.356665
B  0.398519 -0.209922  1.631301  0.356665
C  0.848919 -1.277502  0.264761  0.356665

- Reset the index using reset_index()

In [23]:
df.reset_index()
df

          F         G         H     handg
A  0.293230  0.025665 -0.826068  0.356665
B  0.398519 -0.209922  1.631301  0.356665
C  0.848919 -1.277502  0.264761  0.356665

- Attach a new index
- Create a list of index labels
- Add the index as a column say 'city'
- use set_index('city')

In [24]:
data = { "movieid" : [1,2,3,4,5,6,7,8], 
        "moviename": ["Toy Story (1995)", "Jumanji (1995)",
                      "Grumpier Old Men (1995)",
                      "Waiting to Exhale (1995)",
                      "Father of the Bride Part II (1995)",
                      "Heat (1995)","Sabrina (1995)",
                      "Tom and Huck (1995)"]}
df = pd.DataFrame(data)
a = df.set_index('movieid')
a.loc[2]

moviename    Jumanji (1995)
Name: 2, dtype: object

- reindex. Reindex helps in rearranging the index by providing missing data

In [25]:
df.reindex(columns=['moviename', 'movieid'])

                            moviename  movieid
0                    Toy Story (1995)        1
1                      Jumanji (1995)        2
2             Grumpier Old Men (1995)        3
3            Waiting to Exhale (1995)        4
4  Father of the Bride Part II (1995)        5
5                         Heat (1995)        6
6                      Sabrina (1995)        7
7                 Tom and Huck (1995)        8

In [26]:
import json
json1=open('json1.ipynb')
db1 = json.load(json1)

In [27]:
db1

{'cells': [{'cell_type': 'markdown',
   'metadata': {},
   'source': ['# Json to a flat DF\n',
    '\n',
    '- In this exercise let us process food_data.json and tries to unravel a nested json into a flat DF to be processed further']},
  {'cell_type': 'code',
   'execution_count': 10,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ['import numpy as np\n', 'import pandas as pd']},
  {'cell_type': 'code',
   'execution_count': 11,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ['import json']},
  {'cell_type': 'markdown',
   'metadata': {},
   'source': ['- load the json using json.load']},
  {'cell_type': 'code',
   'execution_count': 66,
   'metadata': {'collapsed': True, 'scrolled': True},
   'outputs': [],
   'source': ["db = json.load(open('food_data.json'))"]},
  {'cell_type': 'markdown',
   'metadata': {},
   'source': ['- check the following\n',
    '- number of data items in the dictionary\n',
    '- keys of the dictionary']},
  {'cell_type': 'code',
   'execution_count': None,
   'metadata': {'scrolled': True},
   'outputs': [],
   'source': ['len']},
  {'cell_type': 'code',
   'execution_count': 60,
   'metadata': {},
   'outputs': [{'data': {'text/plain': ["[u'portions',\n",
       " u'description',\n",
       " u'tags',\n",
       " u'nutrients',\n",
       " u'group',\n",
       " u'id',\n",
       " u'manufacturer']"]},
     'execution_count': 60,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ['db[0].keys()']},
  {'cell_type': 'code',
   'execution_count': 61,
   'metadata': {},
   'outputs': [{'data': {'text/plain': ['162']},
     'execution_count': 61,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ["len(db[0]['nutrients'])"]},
  {'cell_type': 'code',
   'execution_count': 62,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ["nutrients = pd.DataFrame(db[0]['nutrients'])"]},
  {'cell_type': 'code',
   'execution_count': 63,
   'metadata': {},
   'outputs': [{'data': {'text/html': ['<div>\n',
       '<style>\n',
       '    .dataframe thead tr:only-child th {\n',
       '        text-align: right;\n',
       '    }\n',
       '\n',
       '    .dataframe thead th {\n',
       '        text-align: left;\n',
       '    }\n',
       '\n',
       '    .dataframe tbody tr th {\n',
       '        vertical-align: top;\n',
       '    }\n',
       '</style>\n',
       '<table border="1" class="dataframe">\n',
       '  <thead>\n',
       '    <tr style="text-align: right;">\n',
       '      <th></th>\n',
       '      <th>description</th>\n',
       '      <th>group</th>\n',
       '      <th>units</th>\n',
       '      <th>value</th>\n',
       '    </tr>\n',
       '  </thead>\n',
       '  <tbody>\n',
       '    <tr>\n',
       '      <th>0</th>\n',
       '      <td>Protein</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>25.18</td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>1</th>\n',
       '      <td>Total lipid (fat)</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>29.20</td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>2</th>\n',
       '      <td>Carbohydrate, by difference</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>3.06</td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>3</th>\n',
       '      <td>Ash</td>\n',
       '      <td>Other</td>\n',
       '      <td>g</td>\n',
       '      <td>3.28</td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>4</th>\n',
       '      <td>Energy</td>\n',
       '      <td>Energy</td>\n',
       '      <td>kcal</td>\n',
       '      <td>376.00</td>\n',
       '    </tr>\n',
       '  </tbody>\n',
       '</table>\n',
       '</div>'],
      'text/plain': ['                   description        group units   value\n',
       '0                      Protein  Composition     g   25.18\n',
       '1            Total lipid (fat)  Composition     g   29.20\n',
       '2  Carbohydrate, by difference  Composition     g    3.06\n',
       '3                          Ash        Other     g    3.28\n',
       '4                       Energy       Energy  kcal  376.00']},
     'execution_count': 63,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ['nutrients.head()']},
  {'cell_type': 'code',
   'execution_count': 18,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ["info_keys=['description', 'group', 'id', 'manufacturer']"]},
  {'cell_type': 'code',
   'execution_count': 44,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ['info = pd.DataFrame(db, columns=info_keys)']},
  {'cell_type': 'code',
   'execution_count': 20,
   'metadata': {},
   'outputs': [{'data': {'text/html': ['<div>\n',
       '<style>\n',
       '    .dataframe thead tr:only-child th {\n',
       '        text-align: right;\n',
       '    }\n',
       '\n',
       '    .dataframe thead th {\n',
       '        text-align: left;\n',
       '    }\n',
       '\n',
       '    .dataframe tbody tr th {\n',
       '        vertical-align: top;\n',
       '    }\n',
       '</style>\n',
       '<table border="1" class="dataframe">\n',
       '  <thead>\n',
       '    <tr style="text-align: right;">\n',
       '      <th></th>\n',
       '      <th>description</th>\n',
       '      <th>group</th>\n',
       '      <th>id</th>\n',
       '      <th>manufacturer</th>\n',
       '    </tr>\n',
       '  </thead>\n',
       '  <tbody>\n',
       '    <tr>\n',
       '      <th>0</th>\n',
       '      <td>Cheese, caraway</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td>1008</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>1</th>\n',
       '      <td>Cheese, cheddar</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td>1009</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>2</th>\n',
       '      <td>Cheese, edam</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td>1018</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '  </tbody>\n',
       '</table>\n',
       '</div>'],
      'text/plain': ['       description                   group    id manufacturer\n',
       '0  Cheese, caraway  Dairy and Egg Products  1008             \n',
       '1  Cheese, cheddar  Dairy and Egg Products  1009             \n',
       '2     Cheese, edam  Dairy and Egg Products  1018             ']},
     'execution_count': 20,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ['info.head(3)']},
  {'cell_type': 'code',
   'execution_count': 21,
   'metadata': {},
   'outputs': [{'name': 'stdout',
     'output_type': 'stream',
     'text': ["<class 'pandas.core.frame.DataFrame'>\n",
      'RangeIndex: 200 entries, 0 to 199\n',
      'Data columns (total 4 columns):\n',
      'description     200 non-null object\n',
      'group           200 non-null object\n',
      'id              200 non-null int64\n',
      'manufacturer    134 non-null object\n',
      'dtypes: int64(1), object(3)\n',
      'memory usage: 6.3+ KB\n']}],
   'source': ['info.info()']},
  {'cell_type': 'code',
   'execution_count': 22,
   'metadata': {},
   'outputs': [{'data': {'text/plain': ['Baby Foods                86\n',
       'Dairy and Egg Products    73\n',
       'Spices and Herbs          41\n',
       'Name: group, dtype: int64']},
     'execution_count': 22,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ["info['group'].value_counts()"]},
  {'cell_type': 'code',
   'execution_count': 45,
   'metadata': {},
   'outputs': [],
   'source': ['nutrients = []\n',
    'for rec in db:\n',
    "    fnuts = pd.DataFrame(rec['nutrients'])\n",
    "    fnuts['id'] = rec['id']\n",
    '    nutrients.append(fnuts)\n',
    'nutrients = pd.concat(nutrients, ignore_index= True)']},
  {'cell_type': 'code',
   'execution_count': 46,
   'metadata': {},
   'outputs': [{'data': {'text/html': ['<div>\n',
       '<style>\n',
       '    .dataframe thead tr:only-child th {\n',
       '        text-align: right;\n',
       '    }\n',
       '\n',
       '    .dataframe thead th {\n',
       '        text-align: left;\n',
       '    }\n',
       '\n',
       '    .dataframe tbody tr th {\n',
       '        vertical-align: top;\n',
       '    }\n',
       '</style>\n',
       '<table border="1" class="dataframe">\n',
       '  <thead>\n',
       '    <tr style="text-align: right;">\n',
       '      <th></th>\n',
       '      <th>description</th>\n',
       '      <th>group</th>\n',
       '      <th>units</th>\n',
       '      <th>value</th>\n',
       '      <th>id</th>\n',
       '    </tr>\n',
       '  </thead>\n',
       '  <tbody>\n',
       '    <tr>\n',
       '      <th>0</th>\n',
       '      <td>Protein</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>25.18</td>\n',
       '      <td>1008</td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>1</th>\n',
       '      <td>Total lipid (fat)</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>29.20</td>\n',
       '      <td>1008</td>\n',
       '    </tr>\n',
       '  </tbody>\n',
       '</table>\n',
       '</div>'],
      'text/plain': ['         description        group units  value    id\n',
       '0            Protein  Composition     g  25.18  1008\n',
       '1  Total lipid (fat)  Composition     g  29.20  1008']},
     'execution_count': 46,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ['nutrients.head(2)']},
  {'cell_type': 'code',
   'execution_count': 47,
   'metadata': {},
   'outputs': [{'name': 'stdout',
     'output_type': 'stream',
     'text': ["<class 'pandas.core.frame.DataFrame'>\n",
      'RangeIndex: 25864 entries, 0 to 25863\n',
      'Data columns (total 5 columns):\n',
      'description    25864 non-null object\n',
      'group          25864 non-null object\n',
      'units          25864 non-null object\n',
      'value          25864 non-null float64\n',
      'id             25864 non-null int64\n',
      'dtypes: float64(1), int64(1), object(3)\n',
      'memory usage: 1010.4+ KB\n']}],
   'source': ['nutrients.info()']},
  {'cell_type': 'code',
   'execution_count': 48,
   'metadata': {},
   'outputs': [{'data': {'text/html': ['<div>\n',
       '<style>\n',
       '    .dataframe thead tr:only-child th {\n',
       '        text-align: right;\n',
       '    }\n',
       '\n',
       '    .dataframe thead th {\n',
       '        text-align: left;\n',
       '    }\n',
       '\n',
       '    .dataframe tbody tr th {\n',
       '        vertical-align: top;\n',
       '    }\n',
       '</style>\n',
       '<table border="1" class="dataframe">\n',
       '  <thead>\n',
       '    <tr style="text-align: right;">\n',
       '      <th></th>\n',
       '      <th>description</th>\n',
       '      <th>group</th>\n',
       '      <th>units</th>\n',
       '      <th>value</th>\n',
       '      <th>id</th>\n',
       '    </tr>\n',
       '  </thead>\n',
       '  <tbody>\n',
       '    <tr>\n',
       '      <th>0</th>\n',
       '      <td>Protein</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>25.18</td>\n',
       '      <td>1008</td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>54</th>\n',
       '      <td>Protein</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>25.18</td>\n',
       '      <td>1008</td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>108</th>\n',
       '      <td>Protein</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>25.18</td>\n',
       '      <td>1008</td>\n',
       '    </tr>\n',
       '  </tbody>\n',
       '</table>\n',
       '</div>'],
      'text/plain': ['    description        group units  value    id\n',
       '0       Protein  Composition     g  25.18  1008\n',
       '54      Protein  Composition     g  25.18  1008\n',
       '108     Protein  Composition     g  25.18  1008']},
     'execution_count': 48,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ["nutrients[(nutrients['id'] == 1008) & (nutrients['description'] == 'Protein')]"]},
  {'cell_type': 'code',
   'execution_count': 49,
   'metadata': {},
   'outputs': [{'data': {'text/plain': ['13889']},
     'execution_count': 49,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ['nutrients.duplicated().sum()']},
  {'cell_type': 'code',
   'execution_count': 50,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ['nutrients = nutrients.drop_duplicates()']},
  {'cell_type': 'code',
   'execution_count': 51,
   'metadata': {},
   'outputs': [{'data': {'text/plain': ['11975']},
     'execution_count': 51,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ['len(nutrients)']},
  {'cell_type': 'code',
   'execution_count': 52,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ["col_mapping = {'description' : 'food', 'group' : 'fgroup'}"]},
  {'cell_type': 'code',
   'execution_count': 53,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ['info = info.rename(columns=col_mapping, copy=False)']},
  {'cell_type': 'code',
   'execution_count': 54,
   'metadata': {},
   'outputs': [{'data': {'text/html': ['<div>\n',
       '<style>\n',
       '    .dataframe thead tr:only-child th {\n',
       '        text-align: right;\n',
       '    }\n',
       '\n',
       '    .dataframe thead th {\n',
       '        text-align: left;\n',
       '    }\n',
       '\n',
       '    .dataframe tbody tr th {\n',
       '        vertical-align: top;\n',
       '    }\n',
       '</style>\n',
       '<table border="1" class="dataframe">\n',
       '  <thead>\n',
       '    <tr style="text-align: right;">\n',
       '      <th></th>\n',
       '      <th>food</th>\n',
       '      <th>fgroup</th>\n',
       '      <th>id</th>\n',
       '      <th>manufacturer</th>\n',
       '    </tr>\n',
       '  </thead>\n',
       '  <tbody>\n',
       '    <tr>\n',
       '      <th>0</th>\n',
       '      <td>Cheese, caraway</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td>1008</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>1</th>\n',
       '      <td>Cheese, cheddar</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td>1009</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>2</th>\n',
       '      <td>Cheese, edam</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td>1018</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '  </tbody>\n',
       '</table>\n',
       '</div>'],
      'text/plain': ['              food                  fgroup    id manufacturer\n',
       '0  Cheese, caraway  Dairy and Egg Products  1008             \n',
       '1  Cheese, cheddar  Dairy and Egg Products  1009             \n',
       '2     Cheese, edam  Dairy and Egg Products  1018             ']},
     'execution_count': 54,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ['info.head(3)']},
  {'cell_type': 'code',
   'execution_count': 55,
   'metadata': {'collapsed': True},
   'outputs': [],
   'source': ["ndata = pd.merge(nutrients, info, on='id', how='outer')"]},
  {'cell_type': 'code',
   'execution_count': 56,
   'metadata': {},
   'outputs': [{'name': 'stdout',
     'output_type': 'stream',
     'text': ["<class 'pandas.core.frame.DataFrame'>\n",
      'Int64Index: 11975 entries, 0 to 11974\n',
      'Data columns (total 8 columns):\n',
      'description     11975 non-null object\n',
      'group           11975 non-null object\n',
      'units           11975 non-null object\n',
      'value           11975 non-null float64\n',
      'id              11975 non-null int64\n',
      'food            11975 non-null object\n',
      'fgroup          11975 non-null object\n',
      'manufacturer    8648 non-null object\n',
      'dtypes: float64(1), int64(1), object(6)\n',
      'memory usage: 842.0+ KB\n']}],
   'source': ['ndata.info()']},
  {'cell_type': 'code',
   'execution_count': 57,
   'metadata': {},
   'outputs': [{'data': {'text/plain': ['description                                       Arginine\n',
       'group                                          Amino Acids\n',
       'units                                                    g\n',
       'value                                                0.104\n',
       'id                                                    3197\n',
       'food            Babyfood, cereal, with egg yolks, strained\n',
       'fgroup                                          Baby Foods\n',
       'manufacturer                                              \n',
       'Name: 10000, dtype: object']},
     'execution_count': 57,
     'metadata': {},
     'output_type': 'execute_result'}],
   'source': ['ndata.loc[10000]']},
  {'cell_type': 'code',
   'execution_count': 59,
   'metadata': {},
   'outputs': [{'data': {'text/html': ['<div>\n',
       '<style>\n',
       '    .dataframe thead tr:only-child th {\n',
       '        text-align: right;\n',
       '    }\n',
       '\n',
       '    .dataframe thead th {\n',
       '        text-align: left;\n',
       '    }\n',
       '\n',
       '    .dataframe tbody tr th {\n',
       '        vertical-align: top;\n',
       '    }\n',
       '</style>\n',
       '<table border="1" class="dataframe">\n',
       '  <thead>\n',
       '    <tr style="text-align: right;">\n',
       '      <th></th>\n',
       '      <th>description</th>\n',
       '      <th>group</th>\n',
       '      <th>units</th>\n',
       '      <th>value</th>\n',
       '      <th>id</th>\n',
       '      <th>food</th>\n',
       '      <th>fgroup</th>\n',
       '      <th>manufacturer</th>\n',
       '    </tr>\n',
       '  </thead>\n',
       '  <tbody>\n',
       '    <tr>\n',
       '      <th>0</th>\n',
       '      <td>Protein</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>25.18</td>\n',
       '      <td>1008</td>\n',
       '      <td>Cheese, caraway</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>1</th>\n',
       '      <td>Total lipid (fat)</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>29.20</td>\n',
       '      <td>1008</td>\n',
       '      <td>Cheese, caraway</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '    <tr>\n',
       '      <th>2</th>\n',
       '      <td>Carbohydrate, by difference</td>\n',
       '      <td>Composition</td>\n',
       '      <td>g</td>\n',
       '      <td>3.06</td>\n',
       '      <td>1008</td>\n',
       '      <td>Cheese, caraway</td>\n',
       '      <td>Dairy and Egg Products</td>\n',
       '      <td></td>\n',
       '    </tr>\n',
       '  </tbody>\n',
       '</table>\n',
       '</div>'],
      'text/plain': ['                   description        group units  value    id  \\\n',
       '0                      Protein  Composition     g  25.18  1008   \n',
       '1            Total lipid (fat)  Composition     g  29.20  1008   \n',
       '2  Carbohydrate, by difference  Composition     g   3.06  1008   \n',
       '\n',